{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "olá",
        "Ola",
        "ola",
        "olá",
        "oi",
        "Oi",
        "Bom dia",
        "Boa tarde",
        "Boa noite"
      ],
      "responses": [
        "Olá, tudo bem? Selecione um sintoma que voce está tendo neste momento:<br><br> - Desânimo <br> - Cansaço <br> - Oscilações de humor <br> - Irritabilidade <br> - Fadiga <br> - Ansiedade" 
      ]
    },

    {
      "tag": "student1",
      "patterns": [
        "desanimo",
        "desânimo",
        "Desanimo",
        "Desânimo",
        "Cansaco",
        "cansaco",
        "cansaço",
        "Cansaço",
        "Fadiga",
        "fadiga",
        "Ansiedade",
        "ansiedade",
        "irritabilidade",
        "Irritabilidade"
      ],
      "responses": [
        "Há quanto tempo você está sentindo esse sintoma. Selecione uma opção abaixo: <br><br>- 2 semanas <br> - 3 meses <br> - 6 meses"
      ]
    },

    {
      "tag": "work",
      "patterns": [
        "profissional"
      ],
      "responses": [
        "Bom, já procurou fazer alguma atividade fisica? A prática de exercicios fisicos estimula a liberação de dopamina, um hormônio responsavel pela sensação de prazer, o que contribui para o bem-estar geral.<br> Comece com uma caminhada todas as manhas. Esse exercécio é ótimo para fortalecer a musculatura das pernas, além de auxiliar na circulação sanguínea. Escolha um local arborizado e com ar fresco para caminhar. Você vai ver a sua disposição mudar para melhor!"
      ]
    },

    {
      "tag": "times2",
      "patterns": [
        "3 meses"
      ],
      "responses": [
        "Por você estar se sentindo assim há mais tempo, o ideal é procurar por um especialista, pois existe a possibilidade de você estar com um quadro leve de depressão. Como forma de amenizar essas sintomas, voce pode fazer algumas pequenas mudanças na sua rotina como meditar, praticar algum esporte, sair com os amigos, ler, enfim, procurar por atividades que ocupem sua mente e movimentem o seu corpo."
      ]
    },

    {
      "tag": "frontend",
      "patterns": [
        "6 meses"
      ],
      "responses": [
        "Você já se encontra em um quadro moderado de depressão que exige acompanhamento médico, além de uma mudança de rotina que envolve tanto o aspecto fisico quanto emocional.<br>Isso pode ser feito com a ajuda de profissionais de saúde como psicologos e psiquiatras que vão te dar todo o suporte que precisa para lidar com essa doença, evitando que ela afete a sua saúde física, mental e também interfira nas suas relações pessoais e profissionais. <br> Além disso, você pode encontrar atendimento gratuito com profissionais especializados. Digite <strong>'sim'</strong> para saber mais."
      ]
    },

    {
      "tag": "atendimento",
      "patterns": [
        "sim",
        "Sim"
      ],
      "responses": [
        "Você sabia que o Sistema Único de Saúde (SUS), através da Rede de Atenção Psicossocial (RAPS), oferece tratamento gratuito para pacientes com sintomas de depressão, ansiedade e outros tipos de transtornos.<br><br> Os serviços incluem desde a atenção primária, com atendimento em Unidade Básica de Saúde (UBS) a tratamentos especializados, no Centro de Atenção Psicossocial (CAPS).<br><br> Neste <a href='https://www.prefeitura.sp.gov.br/cidade/secretarias/saude/atencao_basica/index.php?p=204204' target='_blank'>Link</a> você tem acesso as unidades mais próximas da sua residência e também aos telefones de contato."
      ]
    },

    {
      "tag": "agradecimento",
      "patterns": [
        "obrigado",
        "Obrigado"
      ],
      "responses": [
        "Feliz em ajudar! Até mais!", 
        "Feliz em ajudar! Até mais!", 
        "Conte comigo! Até mais!", 
        "O prazer foi meu! Até mais!",
        "Disponha! Até mais!", 
        "De nada! Até mais!", 
        "Não tem de que! Até mais!"
      ]
    }
  ]
}
