{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "olá",
        "Ola",
        "ola",
        "olá",
        "oi",
        "Oi",
        "Bom dia",
        "Boa tarde",
        "Boa noite"
      ],
      "responses": [
        "Olá, tudo bem? Escolha uma opção a seguir para iniciar a sua navegação:\n 1 - Sou estudante e quero saber mais sobre cursos \n 2 - Sou profissional e estou em busca de novas oportunidades"
      ]
    },

    {
      "tag": "escolha1",
      "patterns": [
        "1"
      ],
      "responses": [
        "Selecione um curso: front end, back end, full stack."
      ]
    },

    {
      "tag": "escolha2",
      "patterns": [
        "2"
      ],
      "responses": [
        "Bem vindo à BeDev. Chegou a hora de conquistar aquela tão sonhada vaga como programador no mercado de trabalho. Nossas vagas atendem tanto profissionais em início de carreira quanto aqueles mais experientes. \n Tem espaço para todo mundo!. Agora fala pra gente, qual é o seu nível para que possamos te direcionar melhor aqui: \n 1 - Junior \n 2 - Pleno \n 3 - Senior"
      ]
    },


    {
      "tag": "frontend",
      "patterns": [
        "front end"
      ],
      "responses": [
        "Bem vindo à formação Front End. Aqui você terá a oportunidade de aprender a desenvolver layouts fantásticos com os mais modernos e atuais frameworks do mercado. Selecione uma linguagem de programação do seu interesse: Javascript, Angular ou React?"
      ]
    },

    {
      "tag": "javascript",
      "patterns": [
        "javascript"
      ],
      "responses": [
        "Otima escolha! Além de ser popular e fácil de aprender, o javascript também é a porta de entrada para dominar frameworks como React e Angular.\n Portanto, aprender seus fundamentos é essencial para se sobressair no mercado de trabalho."
      ]
    },

     {
      "tag": "backend",
      "patterns": [
        "back end"
      ],
      "responses": [
        "Bem vindo à formação Back End. Aqui você terá a oportunidade de aprender a a criar APIs e estruturas robustas com os mais modernos e atuais frameworks do mercado. \n Selecione uma linguagem de programação do seu interesse: Java, C#, Python, Node"
      ]
    },

    {
      "tag": "nivelJunior",
      "patterns": [
        "1"
      ],
      "responses": [
        "Olá, pequeno gafanhoto. Chegou a sua vez de brilhar. Vamos conferir as melhores vagas para quem está em início de carreira!"
      ]
    },

    {
      "tag": "nivelPleno",
      "patterns": [
        "2"
      ],
      "responses": [
        "Olá, programador Pleno. Apesar de ainda estar aprimorando suas habilidades, você já possui experiência suficiente para se virar sozinho e orientar profissionais em início de carreira. Nada mais justo do que trabalhar em empresas que te valorizem, com condições e salários a sua altura. Vamos conhecer algumas desssas oportunidades?"
      ]
    },

    {
      "tag": "nivelSenior",
      "patterns": [
        "3"
      ],
      "responses": [
        "Olá, você que já percorreu um longo caminho para chegar até aqui. Para você, separei algumas vagas interessantes que vão oferecer desafios ainda maiores para pôr em prática todo o seu conhecimento."
      ]
    }
  ]
}
